In [1]:
# started on Aug 23

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [4]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [9]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
   ....:                      [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = np.nan

In [15]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [18]:
df.iloc[:4, 1] = np.nan

In [19]:
df.iloc[:2, 2] = np.nan

In [20]:
df

          0         1         2
0  0.462869       NaN       NaN
1 -1.046638       NaN       NaN
2 -1.212023       NaN  0.290112
3 -0.722384       NaN -0.972737
4 -2.116751  2.061281  1.125763
5 -0.591350  1.020551 -0.557930
6 -0.695690 -2.028360 -0.641010

In [21]:
df.dropna()

          0         1         2
4 -2.116751  2.061281  1.125763
5 -0.591350  1.020551 -0.557930
6 -0.695690 -2.028360 -0.641010

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -1.212023       NaN  0.290112
3 -0.722384       NaN -0.972737
4 -2.116751  2.061281  1.125763
5 -0.591350  1.020551 -0.557930
6 -0.695690 -2.028360 -0.641010

In [23]:
df.fillna(0)

          0         1         2
0  0.462869  0.000000  0.000000
1 -1.046638  0.000000  0.000000
2 -1.212023  0.000000  0.290112
3 -0.722384  0.000000 -0.972737
4 -2.116751  2.061281  1.125763
5 -0.591350  1.020551 -0.557930
6 -0.695690 -2.028360 -0.641010

In [24]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.462869  0.500000  0.000000
1 -1.046638  0.500000  0.000000
2 -1.212023  0.500000  0.290112
3 -0.722384  0.500000 -0.972737
4 -2.116751  2.061281  1.125763
5 -0.591350  1.020551 -0.557930
6 -0.695690 -2.028360 -0.641010

In [25]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [26]:
df.iloc[2:, 1] = np.nan

In [27]:
df.iloc[4:, 2] = np.nan

In [28]:
df

          0         1         2
0 -0.112448 -1.742933 -0.112831
1 -0.843266 -0.237836 -1.491489
2 -0.002697       NaN -0.562877
3  0.909145       NaN  0.559805
4 -1.183965       NaN       NaN
5 -0.277253       NaN       NaN

In [29]:
df.fillna(method="ffill")

          0         1         2
0 -0.112448 -1.742933 -0.112831
1 -0.843266 -0.237836 -1.491489
2 -0.002697 -0.237836 -0.562877
3  0.909145 -0.237836  0.559805
4 -1.183965 -0.237836  0.559805
5 -0.277253 -0.237836  0.559805

In [30]:
df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.112448 -1.742933 -0.112831
1 -0.843266 -0.237836 -1.491489
2 -0.002697 -0.237836 -0.562877
3  0.909145 -0.237836  0.559805
4 -1.183965       NaN  0.559805
5 -0.277253       NaN  0.559805

In [31]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [33]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
   ....:                      "k2": [1, 1, 2, 3, 3, 4, 4]})

In [34]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
data["v1"] = range(7)

In [38]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [39]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [40]:
data.drop_duplicates(["k1", "k2"])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [41]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
   ....:                               "pastrami", "corned beef", "bacon",
   ....:                               "pastrami", "honey ham", "nova lox"],
   ....:                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [42]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [44]:
data["animal"] = data["food"].map(meat_to_animal)

In [45]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
def get_animal(x):
   ....:     return meat_to_animal[x]

In [47]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [48]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [49]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [51]:
data[data < 0]=np.nan

In [52]:
data

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [53]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [54]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=["Ohio", "Colorado", "New York"],
   ....:                     columns=["one", "two", "three", "four"])

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [59]:
def transform(x):
   ....:     return x[:4].upper()

In [60]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [61]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [62]:
data.index=data.index.map(transform)

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
str.title

In [65]:
data.rename( columns=str.upper)

      ONE  TWO  THREE  FOUR
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [66]:
data.rename( index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [67]:
data.rename(index={"OHIO": "INDIANA"},
   ....:             columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [68]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [69]:
bins = [18, 25, 35, 60, 100]

In [70]:
age_categories = pd.cut(ages, bins)

In [71]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [72]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [73]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [74]:
pd.value_counts(age_categories.categories)

(18, 25]     1
(25, 35]     1
(35, 60]     1
(60, 100]    1
dtype: int64

In [75]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [76]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [77]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [78]:
data = np.random.uniform(size=20)

In [79]:
pd.cut(data, 4, precision=2)

[(0.74, 0.94], (0.13, 0.34], (0.54, 0.74], (0.74, 0.94], (0.13, 0.34], ..., (0.34, 0.54], (0.13, 0.34], (0.13, 0.34], (0.54, 0.74], (0.74, 0.94]]
Length: 20
Categories (4, interval[float64, right]): [(0.13, 0.34] < (0.34, 0.54] < (0.54, 0.74] < (0.74, 0.94]]

In [80]:
data = np.random.standard_normal(1000)

In [81]:
quartiles = pd.qcut(data, 4, precision=2)

In [82]:
quartiles

[(-3.11, -0.75], (-0.75, -0.047], (-0.75, -0.047], (0.61, 3.02], (0.61, 3.02], ..., (-0.047, 0.61], (-3.11, -0.75], (-0.047, 0.61], (-0.047, 0.61], (-3.11, -0.75]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.11, -0.75] < (-0.75, -0.047] < (-0.047, 0.61] < (0.61, 3.02]]

In [83]:
pd.value_counts(quartiles)

(-3.11, -0.75]     250
(-0.75, -0.047]    250
(-0.047, 0.61]     250
(0.61, 3.02]       250
dtype: int64

In [84]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.098, -1.391]     100
(-1.391, -0.0471]    400
(-0.0471, 1.239]     400
(1.239, 3.02]        100
dtype: int64

In [85]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [86]:
data

            0         1         2         3
0   -0.962815 -0.531501 -0.265743  0.070818
1    0.318020  0.637448 -1.057337 -0.267636
2   -0.369699  0.316249 -0.792466 -0.900001
3   -1.353135 -0.603751 -0.015082 -1.972753
4   -1.149348  0.567592  1.124715 -0.662567
..        ...       ...       ...       ...
995  0.637554 -1.963380  0.528272  0.763707
996 -0.776562  1.204093 -0.798094 -0.926665
997  0.268924  0.311024  0.615620 -0.747845
998 -0.881298  0.972858  0.166422 -1.488432
999  0.771921  0.333776 -0.039506  1.005835

[1000 rows x 4 columns]

In [87]:
col = data[2]

In [88]:
col[col.abs() > 3]

126    3.299415
Name: 2, dtype: float64

In [89]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
15  -3.044507  1.237703  0.252113  0.718867
126  0.470656  1.839533  3.299415  0.763432
137  0.352723  0.278733 -0.188386  3.415335
226 -3.199899  2.172769  0.386530  1.128511
297  3.222271  0.313761  1.624886 -0.621258
442 -3.779587  0.954506  0.390950  2.256362
749 -0.699329 -3.163856 -1.739889 -0.431687
767 -0.047399 -1.467156 -0.995753 -3.307008
800 -0.091568  3.053628  0.372537  0.213835
915  1.348795  3.178749 -1.565066 -1.132629

In [90]:
data[data.abs() > 3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.054437     0.014140     0.017588    -0.011694
std       0.982987     0.983603     0.999659     0.997370
min      -3.000000    -3.000000    -2.897889    -3.000000
25%      -0.572969    -0.605544    -0.657742    -0.691414
50%       0.112580     0.016577     0.003090    -0.034679
75%       0.725029     0.703880     0.694974     0.682184
max       3.000000     3.000000     3.000000     3.000000

In [92]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [93]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [94]:
sampler = np.random.permutation(5)

In [95]:
sampler

array([4, 0, 2, 1, 3])

In [96]:
df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27

In [97]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27

In [98]:
column_sampler = np.random.permutation(7)

In [99]:
column_sampler

array([3, 0, 4, 2, 1, 6, 5])

In [100]:
df.take(column_sampler, axis="columns")

    3   0   4   2   1   6   5
0   3   0   4   2   1   6   5
1  10   7  11   9   8  13  12
2  17  14  18  16  15  20  19
3  24  21  25  23  22  27  26
4  31  28  32  30  29  34  33

In [101]:
df.sample(n=3)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34

In [102]:
choices = pd.Series([5, 7, -1, 6, 4])

In [103]:
choices.sample(n=10, replace=True)

0    5
4    4
3    6
2   -1
4    4
2   -1
2   -1
3    6
3    6
1    7
dtype: int64

In [104]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
   .....:                    "data1": range(6)})

In [105]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [106]:
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [107]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

In [108]:
df_with_dummy = df[["data1"]].join(dummies)

In [109]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [110]:
mnames = ["movie_id", "title", "genres"]

In [111]:
movies = pd.read_table("pydata-book-3rd-edition/datasets/movielens/movies.dat", sep="::",
   .....:                        header=None, names=mnames, engine="python")

In [112]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [113]:
dummies = movies["genres"].str.get_dummies("|")

In [114]:
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0